In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps

In [2]:
from sqlalchemy import create_engine

In [3]:
%load_ext sql

In [4]:
%load_ext sql
%sql postgresql://postgres:lingga28@localhost:2828/datacamp
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

In [5]:
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. Filtering results
The WHERE clause allows you to filter based on text and numeric values in a table using comparison operators.

What does the following query return?

SELECT title\
FROM films\
WHERE release_year > 2000;

Possible Answers:
- A. Films released before the year 2000
- B. Films released after the year 2000
- C. Films released after the year 2001
- D. Films released in 2000

Answer: B

# 2. Using WHERE with numbers
Filtering with WHERE allows you to analyze your data better. You may have a dataset that includes a range of different movies, and you need to do a case study on the most notable films with the biggest budgets. In this case, you'll want to filter your data to a specific budget range.

Now it's your turn to use the WHERE clause to filter numeric values!

### task 1
### Instruction
Select the film_id and imdb_score from the reviews table and filter on scores higher than 7.0.

In [6]:
%%sql

-- Select film_ids and imdb_score with an imdb_score over 7.0
SELECT film_id, imdb_score
FROM cinema.reviews
WHERE imdb_score > 7.0
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(3934, 70999999), (3405, 64000001), (478, 320000005)]

### task 2
### Instruction
Select the film_id and facebook_likes of the first ten records with less than 1000 likes from the reviews table.

In [7]:
%%sql

-- Select film_ids and facebook_likes for ten records with less than 1000 likes 
SELECT film_id, facebook_likes
FROM cinema.reviews
WHERE facebook_likes < 1000
LIMIT 10;

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(3405, 0),
 (478, 491),
 (74, 930),
 (740, 0),
 (2869, 689),
 (1181, 0),
 (2020, 0),
 (2312, 912),
 (1820, 872),
 (831, 975)]

### task 3
### Instruction
Count how many records have a num_votes of at least 100,000; use the alias films_over_100K_votes.

In [8]:
%%sql

-- Count the records with at least 100,000 votes
SELECT COUNT(*) AS films_over_100k_votes
FROM cinema.reviews
WHERE num_votes > 100000;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(1211,)]

# 3. Using WHERE with text
### Exercises
WHERE can also filter string values.

Imagine you are part of an organization that gives cinematography awards, and you have several international categories. Before you confirm an award for every language listed in your dataset, it may be worth seeing if there are enough films of a specific language to make it a fair competition. If there is only one movie or a significant skew, it may be worth considering a different way of giving international awards.

Let's try this out!

### Instruction
- Select and count the language field using the alias count_spanish.
- Apply a filter to select only Spanish from the language field.

In [9]:
%%sql

-- Count the Spanish-language films
SELECT COUNT(language) AS count_spanish
FROM cinema.films
WHERE language = 'Spanish';

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(40,)]

# 4. Using AND
### Exercises
The following exercises combine AND and OR with the WHERE clause. Using these operators together strengthens your queries and analyses of data.

You will apply these new skills now on the films database.

### task 1
### Instructiom
Select the title and release_year for all German-language films released before 2000.

In [10]:
%%sql

-- Select the title and release_year for all German-language films released before 2000
SELECT title, release_year
FROM cinema.films
WHERE language = 'German' AND release_year < 2000;

 * postgresql://postgres:***@localhost:2828/datacamp
6 rows affected.

[('Metropolis', 1927.0),
 ("Pandora's Box", 1929.0),
 ('The Torture Chamber of Dr. Sadism', 1967.0),
 ('Das Boot', 1981.0),
 ('Run Lola Run', 1998.0),
 ('Aimee & Jaguar', 1999.0)]

### task 2
### Instruction
Update the query from the previous step to show German-language films released after 2000 rather than before.

In [11]:
%%sql

-- Update the query to see all German-language films released after 2000
SELECT title, release_year
FROM cinema.films
WHERE release_year > 2000
	AND language = 'German';

 * postgresql://postgres:***@localhost:2828/datacamp
12 rows affected.

[('Good Bye Lenin!', 2003.0),
 ('Downfall', 2004.0),
 ('Summer Storm', 2004.0),
 ('The Lives of Others', 2006.0),
 ('The Baader Meinhof Complex', 2008.0),
 ('The Wave', 2008.0),
 ('Cargo', 2009.0),
 ('Soul Kitchen', 2009.0),
 ('The White Ribbon', 2009.0),
 ('3', 2010.0),
 ('Animals United', 2010.0),
 ('Buen DÃ\xada, RamÃ³n', 2013.0)]

### task 3
### Instruction
Select all details for German-language films released after 2000 but before 2010 using only WHERE and AND.

In [12]:
%%sql

-- Select all records for German-language films released after 2000 and before 2010
SELECT *
FROM cinema.films
WHERE language='German' AND release_year > 2000 and release_year < 2010;

 * postgresql://postgres:***@localhost:2828/datacamp
9 rows affected.

[(1952, 'Good Bye Lenin!', 2003.0, 'Germany', 121.0, 'German', 'R', 4063859.0, 4800000.0),
 (2130, 'Downfall', 2004.0, 'Germany', 178.0, 'German', 'R', 5501940.0, 13500000.0),
 (2224, 'Summer Storm', 2004.0, 'Germany', 98.0, 'German', 'R', 95016.0, 2700000.0),
 (2709, 'The Lives of Others', 2006.0, 'Germany', 137.0, 'German', 'R', 11284657.0, 2000000.0),
 (3100, 'The Baader Meinhof Complex', 2008.0, 'Germany', 184.0, 'German', 'R', 476270.0, 20000000.0),
 (3143, 'The Wave', 2008.0, 'Germany', 107.0, 'German', None, None, 5000000.0),
 (3220, 'Cargo', 2009.0, 'Switzerland', 112.0, 'German', None, None, 4500000.0),
 (3346, 'Soul Kitchen', 2009.0, 'Germany', 99.0, 'German', None, 274385.0, 4000000.0),
 (3412, 'The White Ribbon', 2009.0, 'Germany', 144.0, 'German', 'R', 2222647.0, 12000000.0)]

# 5. Using OR
### Exercises
This time you'll write a query to get the title and release_year of films released in 1990 or 1999, which were in English or Spanish and took in more than $2,000,000 gross.

It looks like a lot, but you can build the query up one step at a time to get comfortable with the underlying concept in each step. Let's go!

### task 1
### Exercises
Select the title and release_year for films released in 1990 or 1999 using only WHERE and OR.

In [13]:
%%sql

-- Find the title and year of films from the 1990 or 1999
SELECT title, release_year
FROM cinema.films
WHERE release_year = 1990 OR release_year = 1999
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Arachnophobia', 1990.0),
 ('Back to the Future Part III', 1990.0),
 ("Child's Play 2", 1990.0)]

### task 2
### Instruction
Filter the records to only include English or Spanish-language films.

In [14]:
%%sql

SELECT title, release_year
FROM cinema.films
WHERE (release_year = 1990 OR release_year = 1999)
-- Add a filter to see only English or Spanish-language films
	AND (language='English' OR language='Spanish')
    LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Arachnophobia', 1990.0),
 ('Back to the Future Part III', 1990.0),
 ("Child's Play 2", 1990.0)]

### task 3
### Instruction
Finally, restrict the query to only return films worth more than $2,000,000 gross.

In [15]:
%%sql

SELECT title, release_year
FROM cinema.films
WHERE (release_year = 1990 OR release_year = 1999)
	AND (language = 'English' OR language = 'Spanish')
-- Filter films with more than $2,000,000 gross
	AND (gross > 2000000);

 * postgresql://postgres:***@localhost:2828/datacamp
(psycopg2.errors.SyntaxError) syntax error at or near "AND"
LINE 2:  AND (gross > 2000000);
         ^

[SQL: -- Filter films with more than 2,000,000 gross
	AND (gross > 2000000);]
(Background on this error at: https://sqlalche.me/e/14/f405)

# 6. Using BETWEEN
### Exercises
Let's use BETWEEN with AND on the films database to get the title and release_year of all Spanish-language films released between 1990 and 2000 (inclusive) with budgets over $100 million.

We have broken the problem into smaller steps so that you can build the query as you go along!

### task 1
### Instruction
Select the title and release_year of all films released between 1990 and 2000 (inclusive) using BETWEEN.

In [16]:
%%sql

-- Select the title and release_year for films released between 1990 and 2000
SELECT title, release_year
FROM cinema.films
WHERE release_year BETWEEN 1990 AND 2000
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Arachnophobia', 1990.0),
 ('Back to the Future Part III', 1990.0),
 ("Child's Play 2", 1990.0)]

### task 2
### Instruction
Build on your previous query to select only films with a budget over $100 million.

In [17]:
%%sql

SELECT title, release_year
FROM cinema.films
WHERE release_year BETWEEN 1990 AND 2000
-- Narrow down your query to films with budgets > $100 million
	AND budget > 100000000;

 * postgresql://postgres:***@localhost:2828/datacamp
(psycopg2.errors.SyntaxError) syntax error at or near "AND"
LINE 2:  AND budget > 100000000;
         ^

[SQL: -- Narrow down your query to films with budgets > 100 million
	AND budget > 100000000;]
(Background on this error at: https://sqlalche.me/e/14/f405)

### task 3
### Instruction
Now, restrict the query to only return Spanish-language films.

In [18]:
%%sql

SELECT title, release_year
FROM cinema.films
WHERE release_year BETWEEN 1990 AND 2000
	AND budget > 100000000
-- Restrict the query to only Spanish-language films
	AND language='Spanish';

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[('Tango', 1998.0)]

### task 4
### Instruction
Finally, amend the query to include all Spanish-language or French-language films with the same criteria.

In [19]:
%%sql

SELECT title, release_year
FROM cinema.films
WHERE release_year BETWEEN 1990 AND 2000
	AND budget > 100000000
-- Amend the query to include Spanish or French-language films
	AND (language = 'Spanish' OR language = 'French');

 * postgresql://postgres:***@localhost:2828/datacamp
2 rows affected.

[('Les couloirs du temps: Les visiteurs II', 1998.0), ('Tango', 1998.0)]

# 8. LIKE and NOT LIKE
### Exercises
The LIKE and NOT LIKE operators can be used to find records that either match or do not match a specified pattern, respectively. They can be coupled with the wildcards % and _. The % will match zero or many characters, and _ will match a single character.

This is useful when you want to filter text, but not to an exact word.

Do the following exercises to gain some practice with these keywords.

### task 1
### Instruction
Select the names of all people whose names begin with 'B'

In [22]:
%%sql

-- Select the names that start with B
SELECT *
FROM cinema.people
WHERE name like 'B%'
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(634, 'B.J. Novak', datetime.date(1979, 7, 31), None),
 (635, 'Babak Najafi', datetime.date(1975, 9, 14), None),
 (636, 'Babar Ahmed', None, None)]

### task 2
### Instruction
Select the names of people whose names have 'r' as the second letter.

In [24]:
%%sql

SELECT name
FROM cinema.people
-- Select the names that have r as the second letter
WHERE name like '_r%'
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Ara Celi',), ('Aramis Knight',), ('Arben Bajraktaraj',)]

### task 3
### Instruction
Select the names of people whose names don't start with 'A'.

In [26]:
%%sql

SELECT name
FROM cinema.people
-- Select names that don't start with A
WHERE name NOT LIKE 'A%'
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('50 Cent',), ('Álex Angulo',), ('Álex de la Iglesia',)]

# 9. WHERE IN
### Exercises
You now know you can query multiple conditions using the IN operator and a set of parentheses. It is a valuable piece of code that helps us keep our queries clean and concise.

Try using the IN operator yourself!

### task 1
### Instruction
Select the title and release_year of all films released in 1990 or 2000 that were longer than two hours.

In [27]:
%%sql

-- Find the title and release_year for all films over two hours in length released in 1990 and 2000
SELECT title, release_year
FROM cinema.films
WHERE duration > 120 AND release_year IN (1990,2000)
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Dances with Wolves', 1990.0), ('Die Hard 2', 1990.0), ('Ghost', 1990.0)]

### task 2
### Instruction
Select the title and language of all films in English, Spanish, or French using IN.

In [29]:
%%sql

-- Find the title and language of all films in English, Spanish, and French
SELECT title, language
FROM cinema.films
WHERE language IN ('English', 'Spanish', 'French')
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('The Broadway Melody', 'English'),
 ("Hell's Angels", 'English'),
 ('A Farewell to Arms', 'English')]

### task 3
### Instruction
Select the title, certification and language of all films certified NC-17 or R that are in English, Italian, or Greek.

In [30]:
%%sql

-- Find the title, certification, and language all films certified NC-17 or R that are in English, Italian, or Greek
SELECT title, certification, language
FROM cinema.films
WHERE certification = 'NC-17' OR certification = 'R' AND language in ('English', 'Italian', 'Greek');
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
2006 rows affected.
(psycopg2.errors.SyntaxError) syntax error at or near "LIMIT"
LINE 1: LIMIT 3; --just an addition, so that the table is not elonga...
        ^

[SQL: LIMIT 3; --just an addition, so that the table is not elongated]
(Background on this error at: https://sqlalche.me/e/14/f405)

# 10. Combining filtering and selecting
### Exercises
Time for a little challenge. So far, your SQL vocabulary from this course includes COUNT(), DISTINCT, LIMIT, WHERE, OR, AND, BETWEEN, LIKE, NOT LIKE, and IN. In this exercise, you will try to use some of these together. Writing more complex queries will be standard for you as you become a qualified SQL programmer.

As this query will be a little more complicated than what you've seen so far, we've included a bit of code to get you started. You will be using DISTINCT here too because, surprise, there are two movies named 'Hamlet' in this dataset!

Follow the instructions to find out what 90's films we have in our dataset that would be suitable for English-speaking teens.

### Instructions
- Count the unique titles from the films database and use the alias provided.
- Filter to include only movies with a release_year from 1990 to 1999, inclusive.
- Add another filter narrowing your query down to English-language films.
- Add a final filter to select only films with 'G', 'PG', 'PG-13' certifications.

In [31]:
%%sql

-- Count the unique titles
SELECT count(DISTINCT title) AS nineties_english_films_for_teens
FROM cinema.films
-- Filter to release_years to between 1990 and 1999
WHERE release_year BETWEEN 1990 AND 1999
-- Filter to English-language films
	AND language='English'
-- Narrow it down to G, PG, and PG-13 certifications
	AND certification IN ('G', 'PG', 'PG-13');

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(310,)]

# 11. What does NULL mean?
### Exercise
I hope you were paying attention in the video. Pop quiz: What does NULL represent?

### Possible Answers

- A. A corrupt entry
- B. A missing value
- C. An empty string
- D .An invalid value

Answer: B

# 12. Practice with NULLs
### Exercises
Well done. Now that you know what NULL means and what it's used for, it's time for some more practice!

Let's explore the films table again to better understand what data you have.

### task 1
### Instruction
Select the title of every film that doesn't have a budget associated with it and use the alias no_budget_info.

In [34]:
%%sql

-- List all film titles with missing budgets
SELECT title as no_budget_info
FROM cinema.films
WHERE budget IS NULL
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[("Pandora's Box",), ('The Prisoner of Zenda',), ('The Blue Bird',)]

### task 2
### Instrcution
Count the number of films with a language associated with them and use the alias count_language_known.

In [36]:
%%sql

-- Count the number of films we have language data for
SELECT count(*) as count_language_known
FROM cinema.films
WHERE language IS NOT NULL;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(4957,)]